---
title: GroupFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GroupFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 100
---

# GroupFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AdditionalElementsRequired { get; }` | `GroupFailures.AdditionalElementsRequired` | FailureDefinitionId |
| `FailureDefinitionId AdditionalElementsRequiredRemove { get; }` | `GroupFailures.AdditionalElementsRequiredRemove` | FailureDefinitionId |
| `FailureDefinitionId AllElementsRemovedFromGroup { get; }` | `GroupFailures.AllElementsRemovedFromGroup` | FailureDefinitionId |
| `FailureDefinitionId AtomTouchedNotAllowed { get; }` | `GroupFailures.AtomTouchedNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId AtomTouchedNotAllowedDelete { get; }` | `GroupFailures.AtomTouchedNotAllowedDelete` | FailureDefinitionId |
| `FailureDefinitionId AtomViolationWhenMultiPlacedInstances { get; }` | `GroupFailures.AtomViolationWhenMultiPlacedInstances` | FailureDefinitionId |
| `FailureDefinitionId AtomViolationWhenOnePlaceInstance { get; }` | `GroupFailures.AtomViolationWhenOnePlaceInstance` | FailureDefinitionId |
| `FailureDefinitionId AttachedGroupNoMirror { get; }` | `GroupFailures.AttachedGroupNoMirror` | FailureDefinitionId |
| `FailureDefinitionId AttachedGroupNoPasteToView { get; }` | `GroupFailures.AttachedGroupNoPasteToView` | FailureDefinitionId |
| `FailureDefinitionId BadProblemWithGroup { get; }` | `GroupFailures.BadProblemWithGroup` | FailureDefinitionId |
| `FailureDefinitionId BadViewForAttachedGroup { get; }` | `GroupFailures.BadViewForAttachedGroup` | FailureDefinitionId |
| `FailureDefinitionId BadViewForAttachedGroupWarn { get; }` | `GroupFailures.BadViewForAttachedGroupWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotAddAlreadyMemberToDiffGroup { get; }` | `GroupFailures.CannotAddAlreadyMemberToDiffGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotAddToGroupFormat { get; }` | `GroupFailures.CannotAddToGroupFormat` | FailureDefinitionId |
| `FailureDefinitionId CannotAddToGroupFormatWarn { get; }` | `GroupFailures.CannotAddToGroupFormatWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyGroup { get; }` | `GroupFailures.CannotCopyGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateGroup { get; }` | `GroupFailures.CannotCreateGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateGroupWithInvalidReferences { get; }` | `GroupFailures.CannotCreateGroupWithInvalidReferences` | FailureDefinitionId |
| `FailureDefinitionId CannotFinishGroupInSketchMode { get; }` | `GroupFailures.CannotFinishGroupInSketchMode` | FailureDefinitionId |
| `FailureDefinitionId CannotLinkAnnotationsForSomeViews { get; }` | `GroupFailures.CannotLinkAnnotationsForSomeViews` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceGroup { get; }` | `GroupFailures.CannotPlaceGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotReloadWithFile { get; }` | `GroupFailures.CannotReloadWithFile` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveGroupMemberConstraint { get; }` | `GroupFailures.CannotRemoveGroupMemberConstraint` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveGroupMemberConstraintWarn { get; }` | `GroupFailures.CannotRemoveGroupMemberConstraintWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveSubordFromGroup { get; }` | `GroupFailures.CannotRemoveSubordFromGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveSubordFromGroupWarn { get; }` | `GroupFailures.CannotRemoveSubordFromGroupWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotSaveGroup { get; }` | `GroupFailures.CannotSaveGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotSwapNestedGroups { get; }` | `GroupFailures.CannotSwapNestedGroups` | FailureDefinitionId |
| `FailureDefinitionId ChildrenDeletedOnGroupSwap { get; }` | `GroupFailures.ChildrenDeletedOnGroupSwap` | FailureDefinitionId |
| `FailureDefinitionId ChildrenLostOnGroupSwap { get; }` | `GroupFailures.ChildrenLostOnGroupSwap` | FailureDefinitionId |
| `FailureDefinitionId DetailsOfNestedGroupsLost { get; }` | `GroupFailures.DetailsOfNestedGroupsLost` | FailureDefinitionId |
| `FailureDefinitionId DimensionsOrTagsReferecedRemoved { get; }` | `GroupFailures.DimensionsOrTagsReferecedRemoved` | FailureDefinitionId |
| `FailureDefinitionId DimRefsGroupMemberSketch { get; }` | `GroupFailures.DimRefsGroupMemberSketch` | FailureDefinitionId |
| `FailureDefinitionId DontEditNestedGroup { get; }` | `GroupFailures.DontEditNestedGroup` | FailureDefinitionId |
| `FailureDefinitionId ElementChangedMoreThanAllowed { get; }` | `GroupFailures.ElementChangedMoreThanAllowed` | FailureDefinitionId |
| `FailureDefinitionId ElementsContainsFabricationData { get; }` | `GroupFailures.ElementsContainsFabricationData` | FailureDefinitionId |
| `FailureDefinitionId ExcludedElementsRestoredInLink { get; }` | `GroupFailures.ExcludedElementsRestoredInLink` | FailureDefinitionId |
| `FailureDefinitionId FailedToChangeGroupLevelRef { get; }` | `GroupFailures.FailedToChangeGroupLevelRef` | FailureDefinitionId |
| `FailureDefinitionId FailedToSetLeaderGroupId { get; }` | `GroupFailures.FailedToSetLeaderGroupId` | FailureDefinitionId |
| `FailureDefinitionId FailedToTransformAttachedGroup { get; }` | `GroupFailures.FailedToTransformAttachedGroup` | FailureDefinitionId |
| `FailureDefinitionId GroupAmongstLoadedRenamed { get; }` | `GroupFailures.GroupAmongstLoadedRenamed` | FailureDefinitionId |
| `FailureDefinitionId GroupCannotMixBackAndForegroundDetail { get; }` | `GroupFailures.GroupCannotMixBackAndForegroundDetail` | FailureDefinitionId |
| `FailureDefinitionId GroupCannotSave { get; }` | `GroupFailures.GroupCannotSave` | FailureDefinitionId |
| `FailureDefinitionId GroupCannotSaveWarn { get; }` | `GroupFailures.GroupCannotSaveWarn` | FailureDefinitionId |
| `FailureDefinitionId GroupChangeNoPlaceElements { get; }` | `GroupFailures.GroupChangeNoPlaceElements` | FailureDefinitionId |
| `FailureDefinitionId GroupEditModeNoDuplicates { get; }` | `GroupFailures.GroupEditModeNoDuplicates` | FailureDefinitionId |
| `FailureDefinitionId GroupedModelElemHasViewSpecificSubordinates { get; }` | `GroupFailures.GroupedModelElemHasViewSpecificSubordinates` | FailureDefinitionId |
| `FailureDefinitionId GroupHadFailedElementsWhileUpdating { get; }` | `GroupFailures.GroupHadFailedElementsWhileUpdating` | FailureDefinitionId |
| `FailureDefinitionId GroupPropagationFailedSketch { get; }` | `GroupFailures.GroupPropagationFailedSketch` | FailureDefinitionId |
| `FailureDefinitionId GroupPropagationFailedUngroup { get; }` | `GroupFailures.GroupPropagationFailedUngroup` | FailureDefinitionId |
| `FailureDefinitionId GroupPropagationUserCancelled { get; }` | `GroupFailures.GroupPropagationUserCancelled` | FailureDefinitionId |
| `FailureDefinitionId GroupsHasCycle { get; }` | `GroupFailures.GroupsHasCycle` | FailureDefinitionId |
| `FailureDefinitionId GroupsHaveDifferentMembers { get; }` | `GroupFailures.GroupsHaveDifferentMembers` | FailureDefinitionId |
| `FailureDefinitionId GroupsNotCompatibleForTypeChange { get; }` | `GroupFailures.GroupsNotCompatibleForTypeChange` | FailureDefinitionId |
| `FailureDefinitionId GroupViewSpecificDiffViews { get; }` | `GroupFailures.GroupViewSpecificDiffViews` | FailureDefinitionId |
| `FailureDefinitionId InvalidGroup { get; }` | `GroupFailures.InvalidGroup` | FailureDefinitionId |
| `FailureDefinitionId LastCopyOfGroupDeleted { get; }` | `GroupFailures.LastCopyOfGroupDeleted` | FailureDefinitionId |
| `FailureDefinitionId LastGroupMemberExcluded { get; }` | `GroupFailures.LastGroupMemberExcluded` | FailureDefinitionId |
| `FailureDefinitionId LinkVisibilityLost { get; }` | `GroupFailures.LinkVisibilityLost` | FailureDefinitionId |
| `FailureDefinitionId LoadOfGroupAbortedByUser { get; }` | `GroupFailures.LoadOfGroupAbortedByUser` | FailureDefinitionId |
| `FailureDefinitionId MembersAlignWarn { get; }` | `GroupFailures.MembersAlignWarn` | FailureDefinitionId |
| `FailureDefinitionId MembersExcluded { get; }` | `GroupFailures.MembersExcluded` | FailureDefinitionId |
| `FailureDefinitionId MembersExcludedWarn { get; }` | `GroupFailures.MembersExcludedWarn` | FailureDefinitionId |
| `FailureDefinitionId MembersMovedToProjectToMakeConsistent { get; }` | `GroupFailures.MembersMovedToProjectToMakeConsistent` | FailureDefinitionId |
| `FailureDefinitionId ModifyingMultiGroups { get; }` | `GroupFailures.ModifyingMultiGroups` | FailureDefinitionId |
| `FailureDefinitionId MoveElemFailed { get; }` | `GroupFailures.MoveElemFailed` | FailureDefinitionId |
| `FailureDefinitionId NoAppropriateGroup { get; }` | `GroupFailures.NoAppropriateGroup` | FailureDefinitionId |
| `FailureDefinitionId NoDetailGroups { get; }` | `GroupFailures.NoDetailGroups` | FailureDefinitionId |
| `FailureDefinitionId NoModelGroups { get; }` | `GroupFailures.NoModelGroups` | FailureDefinitionId |
| `FailureDefinitionId NoneOfSelElemsGroupable { get; }` | `GroupFailures.NoneOfSelElemsGroupable` | FailureDefinitionId |
| `FailureDefinitionId NoSwapGroupBeingEdited { get; }` | `GroupFailures.NoSwapGroupBeingEdited` | FailureDefinitionId |
| `FailureDefinitionId NotAGroupFile { get; }` | `GroupFailures.NotAGroupFile` | FailureDefinitionId |
| `FailureDefinitionId NotAllGroupsFullyRestored { get; }` | `GroupFailures.NotAllGroupsFullyRestored` | FailureDefinitionId |
| `FailureDefinitionId PlaceGroupFailed { get; }` | `GroupFailures.PlaceGroupFailed` | FailureDefinitionId |
| `FailureDefinitionId ProblemRegeneratingInGroupUpdate { get; }` | `GroupFailures.ProblemRegeneratingInGroupUpdate` | FailureDefinitionId |
| `FailureDefinitionId ReferencesOutsideGroupAreNotAllowed { get; }` | `GroupFailures.ReferencesOutsideGroupAreNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId RemoveGroupSketchConstraintParent { get; }` | `GroupFailures.RemoveGroupSketchConstraintParent` | FailureDefinitionId |
| `FailureDefinitionId RemovingElemCannotBeGrouped { get; }` | `GroupFailures.RemovingElemCannotBeGrouped` | FailureDefinitionId |
| `FailureDefinitionId RemovingReferencesFromGroupedCurve { get; }` | `GroupFailures.RemovingReferencesFromGroupedCurve` | FailureDefinitionId |
| `FailureDefinitionId RevitUnableToUpadateGroups { get; }` | `GroupFailures.RevitUnableToUpadateGroups` | FailureDefinitionId |
| `FailureDefinitionId SomeGroupInstsBecameEmpty { get; }` | `GroupFailures.SomeGroupInstsBecameEmpty` | FailureDefinitionId |
| `FailureDefinitionId SomeMembersNotRestored { get; }` | `GroupFailures.SomeMembersNotRestored` | FailureDefinitionId |
| `FailureDefinitionId UnableToBindLink { get; }` | `GroupFailures.UnableToBindLink` | FailureDefinitionId |
| `FailureDefinitionId UnableToBindLinkInstances { get; }` | `GroupFailures.UnableToBindLinkInstances` | FailureDefinitionId |
| `FailureDefinitionId UnableToConvertGroupsToLinks { get; }` | `GroupFailures.UnableToConvertGroupsToLinks` | FailureDefinitionId |
| `FailureDefinitionId UnableToCreateAttachedGroup { get; }` | `GroupFailures.UnableToCreateAttachedGroup` | FailureDefinitionId |
| `FailureDefinitionId UnableToDetachGroup { get; }` | `GroupFailures.UnableToDetachGroup` | FailureDefinitionId |
| `FailureDefinitionId UnableToExcludeElems { get; }` | `GroupFailures.UnableToExcludeElems` | FailureDefinitionId |
| `FailureDefinitionId UnableToGroupElems { get; }` | `GroupFailures.UnableToGroupElems` | FailureDefinitionId |
| `FailureDefinitionId UnableToLoadAttachedGroup { get; }` | `GroupFailures.UnableToLoadAttachedGroup` | FailureDefinitionId |
| `FailureDefinitionId UnableToLoadDetailGroup { get; }` | `GroupFailures.UnableToLoadDetailGroup` | FailureDefinitionId |
| `FailureDefinitionId UnableToLoadGroup { get; }` | `GroupFailures.UnableToLoadGroup` | FailureDefinitionId |
| `FailureDefinitionId UnableToMaintainExclusions { get; }` | `GroupFailures.UnableToMaintainExclusions` | FailureDefinitionId |
| `FailureDefinitionId UnableToMaintainExclusionsWarn { get; }` | `GroupFailures.UnableToMaintainExclusionsWarn` | FailureDefinitionId |
| `FailureDefinitionId UnableToMoveElemsToProject { get; }` | `GroupFailures.UnableToMoveElemsToProject` | FailureDefinitionId |
| `FailureDefinitionId UnableToRemapDetails { get; }` | `GroupFailures.UnableToRemapDetails` | FailureDefinitionId |
| `FailureDefinitionId UnableToReplaceSelectedGroups { get; }` | `GroupFailures.UnableToReplaceSelectedGroups` | FailureDefinitionId |
| `FailureDefinitionId UnableToRestoreAllMembersOfGroups { get; }` | `GroupFailures.UnableToRestoreAllMembersOfGroups` | FailureDefinitionId |
| `FailureDefinitionId UnableToSaveGroupType { get; }` | `GroupFailures.UnableToSaveGroupType` | FailureDefinitionId |
| `FailureDefinitionId UnableToTransferAttachedGroup { get; }` | `GroupFailures.UnableToTransferAttachedGroup` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```